In [22]:
import pandas as pd
import numpy as np

In [5]:
Data={
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }

df = pd.DataFrame(Data)
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

Note:
    Each column in a DataFrame is a Series

In [6]:
df['Name']

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [8]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [9]:
df['Sex']

0      male
1      male
2    female
Name: Sex, dtype: object

In [14]:
ages = pd.Series([22, 35, 58], name="Age")

In [15]:
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [ ]:
# Do something with a DataFrame or Series

In [16]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [17]:
df['Age'].max()

58

In [18]:
df['Age'].mean()

38.333333333333336

In [19]:
df['Age'].min()

22

In [20]:
#Iâ€™m interested in some basic statistics of the numerical data of my data table

In [21]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000